from typing import List

class Solution:
    def containVirus(self,isInfected:List[List[int]])->int:
        """
        思路：使用DFS找到能扩散最大的病毒区域，进行封锁，
            对未封锁区域进行扩散
        """
        ans = 0
        m, n = len(isInfected), len(isInfected[0])

        def dfs(i, j, p, q):
            isInfected[i][j] = p
            cnta = 0
            cntb = 0
            for x, y in [(i + 1, j), (i - 1, j), (i, j + 1), (i, j - 1)]:
                if 0 <= x < m and 0 <= y < n and isInfected[x][y] == q:
                    a, b = dfs(x, y, p, q)
                    cnta += a
                    cntb += b
                elif 0 <= x < m and 0 <= y < n and isInfected[x][y] == 0:
                    isInfected[x][y] = 1 if p == 1 else 0
                    if flag[x][y] == 0:
                        cnta += 1
                        flag[x][y] = 1
                    cntb += 1
            return cnta, cntb

        while 1:
            f = 0  # 最大感染范围
            g = 0  # 最大感染范围的墙数
            t = 0  # 根据本轮是否有病毒扩散，判断是否结束
            k, l = -1, -1  # 记录最大感染范围内的一个病毒节点
            for i in range(m):
                for j in range(n):
                    if isInfected[i][j] == 1:  # 寻找最大感染范围
                        flag = [[0] * n for _ in range(m)]
                        a, b = dfs(i, j, -1, 1)
                        if f < a:
                            f = a
                            g = b
                            k, l = i, j
            ans += g
            if f==0 and g==0:
                break
            dfs(k, l, 2, -1)  # 将感染范围最大的区域拦住，设值为2
            for i in range(m):
                for j in range(n):
                    if isInfected[i][j] == -1:  # 将病毒进行扩散，并恢复为1
                        dfs(i, j, 1, -1)
                        t += 1
            if t == 0:
                break
        return ans

if __name__=="__main__":
    s=Solution()
    isInfected = [[1,1,0,0,1,0,1,1,1,1,1,0,1,1,1,0,1,1,0,0],[1,1,1,1,1,1,1,1,0,1,0,0,0,0,0,1,0,1,0,0],[1,1,1,1,1,1,1,1,1,0,0,1,0,0,0,1,1,1,1,1],[1,1,0,1,1,0,1,0,1,1,0,0,0,0,0,1,1,1,0,1],[1,1,1,0,1,1,0,1,1,0,0,1,1,0,1,1,1,0,0,1],[0,1,0,1,0,1,0,1,0,0,0,0,1,1,1,0,1,0,1,0],[1,0,1,1,1,0,0,0,1,1,0,1,1,0,1,1,1,0,1,1],[1,0,0,1,1,1,0,0,1,1,1,1,0,1,1,1,0,1,0,0],[1,0,1,1,1,1,0,1,1,1,1,0,1,0,1,0,1,0,1,1],[1,0,0,1,1,1,1,1,1,0,1,1,1,0,1,1,0,1,1,1],[1,0,1,0,0,1,1,1,0,1,1,1,1,0,0,1,1,1,0,1],[1,0,1,1,1,0,1,1,1,1,0,1,0,0,1,1,0,1,1,1],[1,0,1,0,1,0,0,1,0,1,1,1,0,1,0,0,1,1,0,1],[1,1,0,0,0,1,0,0,1,1,1,0,0,0,0,1,0,1,0,1],[0,1,1,0,0,1,1,0,0,0,1,1,1,1,0,0,0,1,0,0],[1,1,1,1,1,1,0,1,0,0,1,0,1,1,1,1,0,0,0,0],[0,1,0,0,0,1,1,0,0,1,1,1,1,1,1,0,1,0,0,1],[1,1,1,0,1,1,0,1,0,1,1,1,0,0,1,1,1,1,0,1],[0,0,1,1,1,1,1,1,0,1,0,0,1,0,0,0,0,1,1,1],[0,1,1,1,1,0,1,0,1,1,1,1,0,0,0,1,0,0,0,0]]
    print(s.containVirus(isInfected))
